performance/test.yml
execution:
- concurrency: 15 # Number of users
  hold-for: 55m # Length of stable phase
  ramp-up: 5m # length of ramp-up phase
  scenario: GATEWAY
- concurrency: 15 # Number of users
  hold-for: 55m # Length of stable phase
  ramp-up: 5m # length of ramp-up phase
  scenario: AGENT
- concurrency: 10 # Number of users
  hold-for: 55m # Length of stable phase
  ramp-up: 5m # length of ramp-up phase
  scenario: SEMANTIC
scenarios:
  GATEWAY:
    requests:
    - label: LOGIN
      method: GET
      url: http://localhost:82/api/login/0a38f84a-5393-43a5-bf92-07a9e834b36b
      headers:  # local headers that override global
        Content-Type: application/json
    - label: GET_ITEMS
      method: GET
      url: http://localhost:82/api/registration
      headers:  # local headers that override global
        Content-Type: application/json
    - label: NEIGHBOURS
      method: GET
      url: http://localhost:82/api/discovery/local/neighbours
      headers:  # local headers that override global
        Content-Type: application/json
    - label: PARTNERS
      method: GET
      url: http://localhost:82/api/collaboration/partners
      headers:  # local headers that override global
        Content-Type: application/json
  AGENT:
    requests:
    - label: GET_ITEM
      method: GET
      url: http://localhost:82/api/registration/0a38f84a-5393-43a5-bf92-07a9e834b36b
      headers:  # local headers that override global
        Content-Type: application/json
    - label: INFO
      method: GET
      url: http://localhost:82/api/agent/info
      headers:  # local headers that override global
        Content-Type: application/json
  SEMANTIC:
    requests:
    - label: GET_TD
      method: GET
      url: http://localhost:82/api/discovery/local/td/0a38f84a-5393-43a5-bf92-07a9e834b36b
      headers:  # local headers that override global
        Content-Type: application/json
reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: false # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: stats.xml
  # dump-csv: stats.csv
- module: blazemeter
  report-name: Node_report
  test: Node_test_basic
  project: AURORAL_Node
  upload-artifacts: true
modules:
  blazemeter:
    token: