performance/test_semantic.yml
execution:
- concurrency: 1 # Number of users
  hold-for: 1m # Length of stable phase
  # ramp-up: 5m # length of ramp-up phase
  # throughput: 1
  scenario: SEMANTIC_WRITE
- concurrency: 50 # Number of users
  hold-for: 2m # Length of stable phase
  ramp-up: 8m # length of ramp-up phase
  # throughput: 5
  scenario: SEMANTIC_READ
scenarios:
  SEMANTIC_WRITE:
    requests:
    - label: REGISTER
      method: POST
      url: http://localhost:82/api/registration
      headers:  # local headers that override global
        Content-Type: application/json
      body-file: td.json
    - label: GET_TD_1
      method: GET
      url: http://localhost:82/api/discovery/local/td/4cca0ed6-d72b-4dd5-a68d-fc4b3e6a34ca
      headers:  # local headers that override global
        Content-Type: application/json
  SEMANTIC_READ:
    requests:
    - label: GET_TD_2
      method: GET
      url: http://localhost:82/api/discovery/local/td/9f87ed04-88fa-46bf-9244-339d286afe56
      headers:  # local headers that override global
        Content-Type: application/json
reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: false # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: stats.xml
  dump-csv: stats.csv
- module: blazemeter
  report-name: Node_report
  test: Node_test_semantic
  project: AURORAL_Node
  upload-artifacts: true
modules:
  blazemeter:
    token: 36becf88eea8875a6e106ed8:d013e3a3412aaf3ab9527ad9a7ff74e1c855325cdf336ba9c5ca88ca30803bcb128275de